---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.ReverseIterator
source: html/b2df4ea5-65ff-8ddf-8801-969880878710.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual SlabShapeVertexArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.